LHYWilliam/STM32F103CBT6/Source/main.c
#include "FreeRTOS.h"
#include "stm32f10x.h"
#include "timers.h"

#include "GPIO.h"
#include "Key.h"
#include "LED.h"
#include "OLED.h"
#include "Sampler.h"

LED_t LED = {
    .GPIOxPiny = B2,
    .Mode = HIGH,
};

Key_t Key = {
    .GPIOxPiny = A0,
    .Mode = HIGH,
};

// OLED_t OLED = {
//     .SCL = B8,
//     .SDA = B9,
//     .I2C = ENABLE,
// };

// OLED_t OLED = {
//     .D0 = "B12",
//     .D1 = "B13",
//     .RES = "B14",
//     .DC = "B15",
//     .CS = "A8",
//     .SPI = ENABLE,
// };

OLED_t OLED = {
    .SCL = B8,
    .SDA = B9,
    .Width = 128,
    .Height = 64,
    .I2C = ENABLE,
    .U8g2 = ENABLE,
};

// OLED_t OLED = {
//     .Width = 128,
//     .Height = 64,
//     .SPI = ENABLE,
//     .SPIx = SPI2,
//     .D0 = "B13",
//     .D1 = "B15",
//     .RES = "A8",
//     .DC = "A9",
//     .CS = "B12",
//     .U8g2 = ENABLE,
// };

#define LENGTH 64
uint16_t Data[LENGTH];

Sampler_t Sampler = {
    .Data = Data,
    .Length = LENGTH,

    .ADCx = ADC1,
    .ADC_Channel = "1",
    .GPIOxPiny = A1,

    .DMAx = DMA1,
    .DMA_Channel = 1,

    .TIMx = TIM3,
    .Hz = 10,
    .Priority = 14,
};

TimerHandle_t vLEDTimer;
void vLEDTimerCallback(TimerHandle_t pxTimer);

TimerHandle_t vU8G2Timer;
void vU8G2TimerCallback(TimerHandle_t pxTimer);

int main() {
    SysTick_Config(SystemCoreClock / 1000);

    LED_Init(&LED);
    Key_Init(&Key);

    OLED_Init(&OLED);

    Sampler_Init(&Sampler);

    u8g2_SetFont(&OLED.u8g2, u8g2_font_t0_16_me);

    vLEDTimer = xTimerCreate("vLEDTimer", pdMS_TO_TICKS(100), pdTRUE, (void *)0,
                             vLEDTimerCallback);
    vU8G2Timer = xTimerCreate("vU8G2Timer", pdMS_TO_TICKS(100), pdTRUE,
                              (void *)1, vU8G2TimerCallback);

    xTimerStart(vLEDTimer, 0);
    xTimerStart(vU8G2Timer, 0);

    vTaskStartScheduler();
}